{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "conv1", "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "conv4", "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "pool1", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "name": "d1", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": [3], "center": true, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "conv2", "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "conv5", "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "pool2", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": [3], "center": true, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "name": "d2", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "conv3", "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "conv6", "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "pool3", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": [3], "center": true, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "name": "d3", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "name": "dropout", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 128, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "dense", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 10, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "truncated_normal", "mode": "fan_in", "seed": null}}, "dtype": "float32", "name": "dense_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}]}, "keras_version": "2.2.4-tf"}